tap "felixkratz/formulae"
tap "koekeishiya/formulae"

# CLI ------------------------------------------------------------------
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"

# Cosmetics ------------------------------------------------------------
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"

brew "node"
brew "python"

# Dev ------------------------------------------------------------------
# GitHub command-line tool
brew "gh"
# Powerful, lightweight programming language
brew "lua"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# General-purpose scripting language
brew "stow"
# Change macOS audio source from the command-line
brew "switchaudio-osx"

# Casks -----------------------------------------------------------------
cask "git-credential-manager"
cask "sf-symbols"
cask "alt-tab"
cask "font-sf-mono"
cask "font-sf-pro"

cask "raycast"
cask "alt-tab"
cask "ghossty"
cask "arc"
cask "visual-studio-code"
cask "obsidian"
cask "zed"
cask "slack"
